errors-lang_already_set=🫣 Ця мова вже встановлена як мова за замовчуванням.
errors-unavailable_page=🫣 Ця сторінка недоступна.

errors-user_banned = ⚠️ Вас заблоковано.

    Щоб продовжити використовувати бота, будь ласка, зверніться до адміністратора { $technical_support }

errors-error = 😣 Під час виконання дії сталася <b>помилка</b>, і <b>ми вже працюємо</b> над її виправленням.

    <i>Спробуйте повторити ваш запит пізніше.</i>

errors-neuro_on_maintenance = ⚠️ Нейромережа перебуває на технічному обслуговуванні.

errors-user_not_found = ⚠️ Користувача не знайдено.

errors-error_with_entities = 😣 Не вдалося виконати форматування тексту у відповіді. Спробуйте задати своє питання ще раз.

errors-error_with_length = 😣 Довжина отриманої відповіді від нейромережі перевищує ліміти Telegram. Спробуйте задати своє питання ще раз.

errors-unknown_error = 😣 Сталася невідома помилка. Спробуйте задати своє питання ще раз.

errors-unknown_command = 😔 На жаль, я не знаю такої команди...

    Введіть /start, щоб повернутися до головного меню або оберіть одну з кнопок нижче.

errors-maintenance = 🔧 Бот перебуває на технічному обслуговуванні. Спробуйте знову пізніше.

errors-no = 🫣 Мені здається, це необов'язково...