class ChatTexts:
    autotrans = {
        1: "включена",
        0: "выключена"
    }
    whisper_transcript = """<i>Расшифровка</i>: <code>{}</code>
    
❤️‍🔥 <b>{}</b> — <code>ChatGPT</code>, <code>DALL·E 3</code>, <code>Midjourney V4</code> и <b>множество других нейросетей</b> прямо в Telegram и <b>абсолютно</b> бесплатно!"""

    added_to_chat = """🙋 Приветствую всех участников чата!

🤖 Я — <b>{}</b>, бот для работы с нейросетями.
Мой <b>основной</b> функционал доступен <b>только</b> в <b>личных сообщениях</b>, но я могу помочь Вам и здесь.

<b>В чатах я:</b>
— Расшифровываю <b>голосовые сообщения</b>

<b>В личных сообщениях я:</b>
— Отвечаю на твои вопросы в формате <b>диалога</b> или <b>одиночного сообщения</b>
— Генерирую <b>фотографии</b> по заданному запросу
— Генерирую аудиофайлы по заданному запросу и перевожу их

<b>Мои особенности</b>
— <b>Абсолютно бесплатен</b> и работаю на основе <a href="https://api.futureforge.dev/docs">API FutureForge</a>
— Имею <b>открытый</b> исходный код, который ты можешь найти в моем репозитории на <a href="https://github.com/Belyashik2K/NeuroAI-v2">GitHub</a>

⚠️ <b>Внимание!</b> Управление автоматической транскрипцией доступно по команде <code>/neuroai</code>. Я отвечу на эту команду <b>только</b> если Вы являетесь <b>администратором</b> чата."""

    neuroai = """👥 <i>Информация о чате</i>
├ <b>ID чата</b>: <code>{}</code>
├ <b>Расшифровано сообщений</b>: <code>{}</code>
└ <b>Автоматическая транскрипция</b>: <code>{}</code>"""

    ok = """🥰 Успешно"""
