from config import Config

class ErrorsTexts:

    user_banned = """⚠️ Вы были забанены.
    
Для продолжения работы с ботом обратитесь к администратору {technical_support}""".format(technical_support=Config.technical_support)
    
    error = """😣 При выполнении действия произошла <b>ошибка</b> и <b>мы уже работаем</b> над её исправлением.
            
<i>Попробуйте повторить ваш запрос позже.</i>"""

    error_future_forge = """Ошибка на стороне сервера FutureForge!
    
{}"""

    neuro_on_maintenance = """⚠️ Нейросеть находится на техническом обслуживании."""

    user_not_found = """⚠️ Пользователь не найден."""

    error_with_entities = """😣 При получении ответа не удалось выполнить форматирование текста. Попробуйте задать вопрос ещё раз."""

    error_with_lenght = """😣 Длина полученного ответа от нейросети превышает лимиты Telegram. Попробуйте задать вопрос ещё раз."""

    unknown_error = """😣 Произошла неизвестная ошибка. Попробуйте задать вопрос ещё раз."""

    unknown_command = """😣 К сожалению, я не знаю такой команды. Введите /start для возврата в главное меню или выберите одну из кнопок ниже."""

    maintenance = """🔧 Бот находится на техническом обслуживании. Повторите попытку позднее."""

    no = '🫣 Мне кажется, не стоит...'