errors-lang_already_set=🫣 Этот язык уже установлен как язык по умолчанию
errors-unavailable_page=🫣 Эта страница недоступна

errors-user_banned = ⚠️ Вы были забанены.

    Для продолжения работы с ботом обратитесь к администратору { $ technical_support }

errors-error = 😣 При выполнении действия произошла <b>ошибка</b> и <b>мы уже работаем</b> над её исправлением.

    <i>Попробуйте повторить ваш запрос позже.</i>

errors-neuro_on_maintenance = ⚠️ Нейросеть находится на техническом обслуживании.

errors-user_not_found = ⚠️ Пользователь не найден.

errors-error_with_entities = 😣 При получении ответа не удалось выполнить форматирование текста. Попробуйте задать вопрос ещё раз.

errors-error_with_length = 😣 Длина полученного ответа от нейросети превышает лимиты Telegram. Попробуйте задать вопрос ещё раз.

errors-unknown_error = 😣 Произошла неизвестная ошибка. Попробуйте задать вопрос ещё раз.

errors-unknown_command = 😔 К сожалению, я не знаю такой команды...

    Введите /start для возврата в главное меню или выберите одну из кнопок ниже.

errors-maintenance = 🔧 Бот находится на техническом обслуживании. Повторите попытку позднее.

errors-no = 🫣 Мне кажется, не стоит...
