errors-lang_already_set=🫣 Этот язык уже установлен как язык по умолчанию
errors-unavailable_page=🫣 Эта страница недоступна

errors-user_banned = ⚠️ Вы были забанены.

    Для продолжения работы с ботом обратитесь к администратору { $technical_support }

errors-error = 😣 При выполнении действия произошла <b>ошибка</b> и <b>мы уже работаем</b> над её исправлением.

    <i>Попробуйте повторить ваш запрос позже.</i>

errors-neuro_on_maintenance = ⚠️ Нейросеть находится на техническом обслуживании.

errors-user_not_found = ⚠️ Пользователь не найден.

errors-error_with_entities = 😣 При получении ответа не удалось выполнить форматирование текста. Попробуйте задать вопрос ещё раз.

errors-error_with_length = 😣 Длина полученного ответа от нейросети превышает лимиты Telegram. Попробуйте задать вопрос ещё раз.

errors-unknown_error = 😣 Произошла неизвестная ошибка. Попробуйте задать вопрос ещё раз.

errors-unknown_command = 😔 К сожалению, я не знаю такой команды... 

    Введите /start для возврата в главное меню или выберите одну из кнопок ниже.

errors-limit_exceeded = 😔 К сожалению, в связи с <b>бесплатным</b> доступом к API, бот <b>вынужден соблюдать установленные ограничения</b> на количество запросов в секунду.

    <i>Попробуйте повторить ваш запрос позже.</i>

    ⚠️ Если Вы <b>хотите материально помочь</b> проекту для приобретения <b>премиум-подписки</b> на API, Вы можете сделать это, написав в личные сообщения технической поддержке по <b>кнопке ниже</b>. <b>Спасибо! ❤️</b>

errors-maintenance = 🔧 Бот находится на техническом обслуживании. Повторите попытку позднее.

errors-cant_view_photo = 🫣 К сожалению, модель <code>{ $neuro }</code> не может просматривать фотографии...

    <i>Вы можете задать текстовый вопрос или выбрать модель <code>{ $llava }</code> для просмотра фотографий.</i>

errors-no = 🫣 Мне кажется, не стоит...
