errors-lang_already_set=🫣 该语言已设置为默认语言
errors-unavailable_page=🫣 此页面不可用

errors-user_banned = ⚠️ 您已被封禁。

    要继续使用机器人，请联系管理员 { $ technical_support }

errors-error = 😣 在执行操作时发生了 <b>错误</b>，<b>我们正在努力</b>解决这个问题。

    <i>请稍后重试您的请求。</i>

errors-neuro_on_maintenance = ⚠️ 神经网络正在进行技术维护。

errors-user_not_found = ⚠️ 未找到用户。

errors-error_with_entities = 😣 在获取回答时，无法格式化文本。请重新提出您的问题。

errors-error_with_length = 😣 从神经网络获得的回答长度超过了Telegram的限制。请重新提出您的问题。

errors-unknown_error = 😣 发生了未知错误。请重新提出您的问题。

errors-unknown_command = 😔 很抱歉，我不知道这个命令...

    请输入 /start 返回主菜单或选择下面的一个按钮。

errors-maintenance = 🔧 机器人正在进行技术维护。请稍后重试。

errors-no = 🫣 我觉得不应该...